import random


def generate_list(number_of_students):
    male_name = ['Александр', 'Дмитрий', 'Максим', 'Сергей', 'Андрей', 'Алексей', 'Артём', 'Илья', 'Кирилл', 'Михаил',
                 'Никита', 'Матвей', 'Роман', 'Егор', 'Арсений', 'Иван', 'Денис', 'Евгений', 'Даниил', 'Тимофей',
                 'Владислав', 'Игорь', 'Владимир', 'Павел', 'Руслан', 'Марк', 'Константин', 'Тимур', 'Олег', 'Ярослав',
                 'Антон']
    male_surname = ['Иванов', 'Васильев', 'Петров', 'Смирнов', 'Михайлов', 'Фёдоров', 'Соколов', 'Яковлев', 'Попов',
                    'Андреев', 'Алексеев', 'Александров', 'Лебедев', 'Григорьев', 'Степанов', 'Семёнов', 'Павлов',
                    'Богданов', 'Николаев', 'Дмитриев', 'Егоров', 'Волков', 'Кузнецов', 'Никитин', 'Соловьёв',
                    'Тимофеев', 'Орлов', 'Афанасьев', 'Филиппов', 'Сергеев', 'Захаров', 'Матвеев', 'Виноградов',
                    'Кузьмин', 'Максимов', 'Козлов', 'Ильин', 'Герасимов', 'Марков', 'Новиков', 'Морозов', 'Романов',
                    'Осипов', 'Макаров', 'Зайцев', 'Беляев', 'Гаврилов', 'Антонов', 'Ефимов', 'Леонтьев', 'Давыдов',
                    'Гусев', 'Данилов', 'Киселёв', 'Сорокин', 'Тихомиров', 'Крылов', 'Никифоров', 'Кондратьев',
                    'Кудрявцев', 'Борисов', 'Жуков']
    female_name = ['Анастасия', 'Анна', 'Мария', 'Елена', 'Дарья', 'Алина', 'Ирина', 'Екатерина', 'Арина', 'Полина',
                   'Ольга', 'Юлия', 'Татьяна', 'Наталья', 'Виктория', 'Елизавета', 'Ксения', 'Милана', 'Вероника',
                   'Алиса', 'Валерия', 'Александра', 'Ульяна', 'Кристина', 'София', 'Марина', 'Светлана', 'Варвара',
                   'Софья', 'Диана', 'Яна']
    female_surname = ['Лаврентьева', 'Рамазанова', 'Щербатых', 'Зылькова', 'Цыганова', 'Шеховцова', 'Ионова', 'Ушакова',
                      'Климушина', 'Башкатова', 'Кравцева', 'Маюрова', 'Дейнекина', 'Цейдлерина', 'Гунина', 'Андронова',
                      'Тенишева', 'Толмачёва', 'Жаркова', 'Виноградова', 'Дарюшина', 'Капустова', 'Малюгина',
                      'Калакуцкая', 'Ярустовская', 'Эзерина', 'Михалицина', 'Колонтаева', 'Дудченко', 'Корбылева',
                      'Ярлыкова', 'Селидова', 'Сухиха', 'Акимова', 'Ларионова', 'Анюкова', 'Исаева', 'Головкина',
                      'Парфёнова', 'Ярова']
    exams = ["Информатика", "ЭЭиС", "Web", "История", "АиГ", "КТП", "Философия", "ИС", "Английский", "СИТ", "КСИиВ"]

    generated_list = []
    for i in range(number_of_students):
        # рандомный выбор добавления в список мужчины или женщины.
        if bool(random.randint(0, 1)):
            generated_list.append({
                "name": random.choice(male_name),
                "surname": random.choice(male_surname),
                "exams": sorted(random.sample(population=exams, k=3)),
                "marks": [random.randint(3, 5), random.randint(3, 5), random.randint(3, 5)]})
        else:
            generated_list.append({
                "name": random.choice(female_name),
                "surname": random.choice(female_surname),
                "exams": sorted(random.sample(population=exams, k=3)),
                "marks": [random.randint(3, 5), random.randint(3, 5), random.randint(2, 5)]})
    return generated_list
